app/views/links/_form.html.erb

  <h2>Post to Subs</h2>
  <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"

      id="link_sub_ids_<%= sub.id %>"
      <% if @link.sub_ids.include?(sub.id) %>
---
SELECT "subs".id FROM "subs" INNER JOIN "link_posts" ON "subs"."id" = "link_posts"."sub_id" WHERE "link_posts"."link_id" IS NULL