app/views/subs/show.html.erb

<hr>
<% @sub.links.each do |link| %>
---
SELECT "links".* FROM "links" INNER JOIN "link_posts" ON "links"."id" = "link_posts"."link_id" WHERE "link_posts"."sub_id" = 2