app/controllers/comments_controller.rb

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "8"]]
INSERT INTO "comments" ("body", "created_at", "link_id", "parent_comment_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asdgasdgas"], ["created_at", Wed, 18 Sep 2013 20:27:21 UTC +00:00], ["link_id", 8], ["parent_comment_id", nil], ["updated_at", Wed, 18 Sep 2013 20:27:21 UTC +00:00]]
---
  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.build(params[:comment])

    if @comment.save

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "8"]]
---
  def new
    @link = Link.find(params[:link_id])