app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(params[:link])
    if @link.save
---
INSERT INTO "links" ("body", "created_at", "owner_id", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @link = Link.find(params[:id])
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "8"]]

  def upvote
    @link = Link.find(params[:id])
    @user_vote = UserVote.find_by_link_id_and_user_id(@link.id,current_user.id)
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "user_votes".* FROM "user_votes" WHERE "user_votes"."link_id" = 8 AND "user_votes"."user_id" = 1 LIMIT 1

  def downvote
    @link = Link.find(params[:id])
    @user_vote = UserVote.find_by_link_id_and_user_id(@link.id,current_user.id)
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "user_votes".* FROM "user_votes" WHERE "user_votes"."link_id" = 8 AND "user_votes"."user_id" = 1 LIMIT 1