app/controllers/subs_controller.rb

INSERT INTO "subs" ("created_at", "moderator_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 18 Sep 2013 19:22:54 UTC +00:00], ["moderator_id", 1], ["name", "SSub"], ["updated_at", Wed, 18 Sep 2013 19:22:54 UTC +00:00]]
INSERT INTO "links" ("body", "created_at", "owner_id", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)  [["body", "a body"], ["created_at", Wed, 18 Sep 2013 20:22:56 UTC +00:00], ["owner_id", nil], ["title", "a titl"], ["updated_at", Wed, 18 Sep 2013 20:22:56 UTC +00:00], ["url", "a url"]]
---
  def create
    begin
      ActiveRecord::Base.transaction do
        @sub = current_user.subs.build(name: params[:sub][:name])

        @links = params[:sub][:links_attributes].map do |_,link_params|
          Link.new(link_params)
        end

        @links.reject! { |link| link.url.empty? }

        @sub.save

        @links.each do |link|
          link.subs << @sub