app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save